package com.spider.utils;

/**
 * <p>
 * Title: RetrievalConditionUtil
 * </p>
 * <p>
 * Description: 文书网检索工具类
 * </p>
 * 
 * @author liyongqiang
 * @datetime 2018年10月5日 上午8:24:56
 */
public class SearchUtil {

	/**
	 * 民事案例检索关键字
	 * 
	 * @return
	 */
	public static String[] getCACKW() {

		String[] keyWord = { "合同", "利息", "利率", "合同约定", "民间借贷", "交通事故", "返还", "担保", "鉴定", "强制性规定", "借款合同", "人身损害赔偿",
				"误工费", "给付", "违约金", "贷款", "清偿", "驳回", "处分", "保证", "赔偿责任", "离婚", "违约责任", "交付", "交通事故损害赔偿", "夫妻关系", "传票",
				"买卖合同", "婚姻", "传唤", "民事责任", "债权", "债务人", "精神损害", "缺席判决", "残疾赔偿金", "债权人", "分公司", "保险合同", "追偿", "管辖",
				"第三人", "租赁", "承诺", "垫付", "票据", "变更", "股份有限公司", "抵押", "赔偿金", "连带责任", "劳动合同", "本案争议", "损害赔偿", "赔偿损失",
				"租金", "保证合同", "物业管理", "解除合同", "所有权", "建设工程", "劳动争议", "滞纳金", "保险人", "侵权行为", "共同债务", "程序合法", "投资", "财产保险",
				"保人", "出卖人", "抗辩权", "实际损失", "意思表示真实", "补充协议", "贷款人", "全面履行", "合同履行地", "代理", "被保险人", "赔偿数额", "主要责任",
				"不动产", "房屋买卖", "不履行", "保证期间", "标的物", "授权", "抚养费", "法定代表人", "反诉", "第三者责任险", "合同解除", "担保合同", "房屋租赁" };

		return keyWord;
	}

	/**
	 * 刑事案例关键字
	 * 
	 * @return
	 */
	public static String[] getCRCKW() {

		String[] keyWord = { "非法占有", "减刑", "自首", "程序合法", "罚金", "减轻处罚", "从犯", "交通事故", "共同犯罪", "拘役", "故意犯", "管制",
				"附带民事诉讼", "交通肇事", "犯罪未遂", "没收", "鉴定", "主要责任", "偶犯", "财产权", "违法所得", "人身权利", "误工费", "人身损害赔偿", "立功", "自诉人",
				"财产刑", "扣押", "返还", "交付", "合法财产", "聚众", "伪造", "胁迫", "传唤", "寻衅滋事", "恶意透支", "共同故意", "所有权", "赔偿责任", "聚众斗殴",
				"过失犯", "过失", "驳回", "非法经营", "合同", "票据", "股份有限公司", "利用职务之便", "未成年人", "注册商标", "合伙", "假药", "强制措施", "残疾赔偿金",
				"交通事故损害赔偿", "冒用", "赔偿金", "专卖", "没收财产", "假冒", "代理", "精神损害", "着手", "利息", "传销", "分公司", "投资", "增值税", "挪用公款",
				"和解协议", "羁押", "剥夺政治权利", "合同诈骗", "赔偿协议", "非法所得", "行政拘留", "赔偿数额", "赔偿损失", "正当防卫", "财产保险", "违法行为", "贷款",
				"给付", "公共秩序", "和解", "追诉", "违背妇女意志", "变更", "单位犯罪", "婚姻", "聋哑人", "担保", "犯罪中止", "超载", "劳动报酬", "防卫过当", "租赁",
				"承诺", "处分" };

		return keyWord;
	}

	/**
	 * 行政案例关键字
	 * 
	 * @return
	 */
	public static String[] getADCKW() {

		String[] keyWord = { "程序合法", "驳回", "具体行政行为", "第三人", "不履行", "催告", "违法行为", "法定期限", "不予受理", "工伤", "利害关系", "管辖",
				"房屋征收", "拆迁", "所有权", "变更", "本案争议", "不动产", "合同", "房屋拆迁", "授权", "履行法定职责", "鉴定", "公共利益", "行政赔偿", "土地使用权",
				"建设用地", "交通事故", "房屋所有权", "建设工程", "处分", "撤回起诉", "行政拘留", "土地征收", "类似商品", "没收", "财产权", "宅基地", "给付",
				"国有土地使用权", "土地登记", "行政强制执行", "混淆", "变更登记", "动产", "近似商标", "驳回起诉", "利害关系人", "不作为", "投资", "确权", "法定代表人",
				"传唤", "拆迁安置", "交付", "土地承包经营权", "保险费", "诉讼标的", "房屋权属", "租赁", "强制性规定", "滞纳金", "公共秩序", "劳动合同", "意思表示真实",
				"公证", "房屋产权", "查封", "合法财产", "承包经营", "抵押", "共有", "注册商标", "伪造", "扣押", "保证", "代理人", "委托代理人", "赔偿损失", "返还",
				"书面形式", "强制措施", "超越职权", "股份", "自然资源", "违法所得", "承诺", "不可抗力", "分公司", "债权", "继承", "国家赔偿", "土地权属争议", "基金",
				"承包合同", "股权", "公积金", "恢复原状" };

		return keyWord;
	}

	/**
	 * 赔偿案例关键字
	 * 
	 * @return
	 */
	public static String[] getCOCKW() {

		String[] keyWord = { "行政赔偿", "国家赔偿", "驳回", "赔偿义务", "具体行政行为", "财产权", "赔偿金", "程序合法", "强制措施", "违法行为", "直接损失",
				"精神损害", "不予受理", "赔偿数额", "扣押", "赔偿责任", "赔礼道歉", "法定期限", "恢复名誉", "拆迁", "利息", "侵权行为", "管辖", "冻结", "返还",
				"本案争议", "羁押", "房屋拆迁", "误工费", "查封", "恢复原状", "变更", "给付", "第三人", "所有权", "鉴定", "房屋征收", "不履行", "消除影响", "不动产",
				"合同", "损害赔偿", "合法财产", "利害关系", "宅基地", "刑事拘留", "行政拘留", "土地使用权", "返还财产", "撤回起诉", "拍卖", "溯及力", "驳回起诉",
				"土地征收", "赔偿损失", "授权", "房屋所有权", "变卖", "罚金", "建设用地", "债权", "建设工程", "处分", "取保候审", "实际损失", "投资", "租赁", "公证",
				"租金", "不可抗力", "精神损害赔偿", "公共利益", "拆迁安置", "履行法定职责", "保管", "没收", "精神损失费", "法定赔偿", "交付", "不作为", "交通事故",
				"抵押", "理赔", "补救措施", "先予执行", "担保", "请求权", "伪造", "工伤", "财产保全", "批准逮捕", "监视居住", "国有土地使用权", "没收财产", "法定代表人",
				"保证", "传唤", "房屋产权" };

		return keyWord;
	}

	/**
	 * 执行案例关键字
	 * 
	 * @return
	 */
	public static String[] getIMCKW() {

		String[] keyWord = { "债权", "查封", "冻结", "扣押", "拍卖", "变卖", "合同", "不动产", "变更", "继续履行", "驳回", "处分", "合同约定", "所有权",
				"交付", "第三人", "不履行", "清偿", "抵押", "程序合法", "担保", "土地使用权", "投资", "利息", "和解协议", "债权人", "法定期限", "给付", "动产",
				"强制措施", "租赁", "债务人", "执行和解", "财产保全", "利害关系人", "股权", "财产刑", "房屋买卖", "抵押权", "本案争议", "罚金", "管辖", "房地产开发企业",
				"建设工程", "债权转让", "贷款", "买卖合同", "分公司", "民间借贷", "风险责任", "标的物", "迟延履行", "法定代表人", "共有", "租金", "股份有限公司", "公证",
				"房屋所有权", "优先受偿权", "财产权", "保证", "婚姻", "返还", "保证金", "承诺", "个人财产", "夫妻关系", "担保物权", "借款合同", "强制性规定", "离婚",
				"夫妻共同财产", "建设用地", "不完全履行", "意思表示真实", "房屋租赁", "抵偿", "共同债务", "企业法人", "不予受理", "国有土地使用权", "和解", "破产清算",
				"拆迁", "催告", "劳动争议", "案件受理费", "继承人", "质押", "承租人", "房产证", "授权", "有价证券", "共同财产", "实际履行", "变更登记" };

		return keyWord;
	}
}
